app/controllers/feeds_controller.rb

INSERT INTO "feeds" ("name", "updated_at", "url", "created_at") VALUES(NULL, '2009-06-01 15:10:25', 'http://feeds.feedburner.com/PatentlyO', '2009-06-01 15:10:25')
SELECT * FROM "feeds" WHERE ("feeds"."url" = 'http://feeds.feedburner.com/PatentlyO') LIMIT 1
UPDATE "feeds" SET "name" = 'patentlyo', "updated_at" = '2009-06-01 15:13:03' WHERE "id" = 1
SELECT * FROM "feeds" WHERE ("feeds"."name" = 'patentlyo') LIMIT 1
---
  def show
    if url = params[:url]
      @feed = Feed.find_or_create_by_url(url)

      if name = params[:name]
        @feed.name = name
        @feed.save!
      end
    elsif name = params[:name]
      @feed = Feed.find_by_name(name)