app/controllers/page_revisions_controller.rb

SELECT "pages".id FROM "pages" WHERE ("pages"."name" = 'Home' AND "pages".namespace IS NULL) LIMIT 1
---
  def find_page
    if page_id = params[:page_id]
      @page = Page.find(page_id)
    elsif page_name = params[:page_name]
      @page = Page.find_by_namespace_and_name(params[:page_namespace], page_name)

SELECT * FROM "page_revisions" WHERE ("page_revisions"."id" = 4 AND ("page_revisions".page_id = 1)) ORDER BY created_at ASC
---
  def find_page_revision
    @page_revision = @page.page_revisions.find(params[:id])