app/controllers/pages_controller.rb

  def update
    @page.update_attributes!(params[:page])
---
UPDATE "pages" SET "content" = 'This is the banana page. [[Orange]], [[Peach]].', "updated_at" = '2009-04-20 16:50:55' WHERE "id" = 2

  def find_page
    if id = params[:id]
      @page = Page.find(id)
    elsif name = params[:name]
      @page = Page.find_by_namespace_and_name(params[:namespace], name)
---
SELECT * FROM "pages" WHERE ("pages"."id" = 8)
SELECT "pages".id FROM "pages" WHERE ("pages"."name" = 'MedicalUniversityOfSouthCarolina' AND "pages".namespace = 'Client') LIMIT 1

  def find_pages
    @pages = Page.all
---
SELECT * FROM "pages"